const Han = {
  name: "한용운",
  photoSrc:
    "http://e-gonghun.mpva.go.kr/hise/ua/getImage.do?mngNo=8862&type=CH",
  hungyeog: "대한민국장",
  seohun: "1962년",
  introduction: `선생은 1879년 8월 29일 충남 홍성군 결성면 성곡리에서 한응준(韓應俊)과 온양 방씨(溫陽方氏) 사이에서 차남으로 태어났다. 본관은 청주이며 자(字)는 정옥(貞玉), 속명은 유천(裕天), 법명(法名)은 용운(龍雲), 법호(法號)는 만해(萬海)이다.\n\n어려서 서당에서 한학을 수학한 뒤, 향리에서 훈장으로 학동을 가르쳤다. 유년시절에는 부친으로부터 의인(義人) 및 걸사(乞士)의 기개와 언행을 전해 듣고 나라와 사회에 기여하겠다는 다짐을 하였다.\n\n그리하여 기울어 가는 국운 속에서 홍성에서 전개되었던 동학농민전쟁과 의병운동을 목격하면서 집에 안주하지 않고 세상으로 나왔다. 이런 결단으로 선생은 나라를 구하려고 집을 나왔다가, 우선 ‘인생은 무엇인가’를 풀기 위해 설악산 백담사로 들어갔다. 백담사에서 불교의 기초지식을 배웠지만, 문명세계를 알고 싶은 호기심으로 세계일주를 단행하였다. \n\n세계일주를 시베리아에서 중단한 선생은 설악산 백담사로 돌아왔다. 속세와 인연을 끊고 연곡(蓮谷)선사를 은사로 출가하여 정식으로 승려가 되었다.    
    불교사상을 탐구한 선생은 일본으로 들어오는 문명세계를 확인하기 위하여 1908년에는 일본유학을 단행하였다. 6개월의 짧은 유학 생활에서 선생은 불교 근대화라는 새로운 세계를 확인하였다.
    `
};

const Lee = {
  name: "이동휘",
  photoSrc:
    "http://e-gonghun.mpva.go.kr/hise/ua/getImage.do?mngNo=81254&type=CH",
  hungyeog: "대통령장",
  seohun: "1995년",
  introduction: `1873년 함경남도 단천(端川)에서 출생하였다. 1899년 서울의 육군무관학교를 졸업, 육군참령(參領)이 되어 강화진위대(江華鎭衛隊)에서 근무하였다. \n\n1902년 개혁당(開革黨)을 조직, 개화운동을 하였으며, 1907년 8월 1일 일제가 한일신협약을 요구하여 강제로 한국군 군대를 해산하자 이에 분개하여 강화도 전등사(傳燈寺)에서 의병을 일으키려다 체포되었다. \n\n미국인 선교사의 도움을 받아 석방되었고 그해 안창호(安昌浩) 등과 신민회(新民會)를 조직하여 항일운동을 하였다. 1911년 ‘105인 사건’에 연루되어 투옥되었다가 석방된 뒤 1913년 시베리아 북간도지역으로 망명하였고 블라디보스톡에서 차르 정권에 체포되어 감금되었다가 볼셰비키에 의해 석방되었다. \n\n북간도를 무대로 일본군과 싸우기 위한 무관을 양성하는데 앞장섰으며 하바롭스크에서 김알렉산드라와 함께 한인사회당(韓人社會黨)을 조직하여 활동하였고 고려사회당(高麗社會黨)을 조직하였다가 활동무대를 상해로 옮기면서 고려공산당(高麗共産黨)으로 개칭하였다.
      \n\n1919년 5월 김립(金立)과 함께 상하이로 이동하여 대한민국임시정부에 참여하였고 북간도지방에서 고려공산당을 조직하여 활동한 영향력을 배경으로 군무총장, 1920년 국무총리를 지냈다. \n\n하지만 이승만(李承晩)·안창호·여운형 등과 독립운동을 전개하는 방법론을 두고 대립하였다. 그는 오직 무력에 의해서 일본군을 격퇴해야 하는 것으로 생각했고 공산당의 이념에 대해서도 잘 모른다고 술회했다. 그는 무장으로서 조선독립을 위해 일본과 싸우는 것만이 최선의 방법이었다.`
};

const Kim = {
  name: "김구",
  photoSrc: "http://e-gonghun.mpva.go.kr/hise/ua/getImage.do?mngNo=318&type=CH",
  hungyeog: "대한민국장",
  seohun: "1962년",
  introduction: `한국의 정치가·독립운동가. 상하이[上海]로 망명, 대한민국임시정부 조직에 참여하고 1944년 대한민국임시정부 주석에 선임되었다. \n\n신민회, 한인애국단 등에서 활발하게 활동하였다. 1962년 건국훈장 대한민국장이 추서되었다.    [네이버 지식백과] 김구 [金九] (두산백과)
    본관은 안동(安東)이다. 호 백범(白凡), 아명 창암(昌岩), 본명 창수(昌洙)였으나 구(九)로 개명, 법명 원종(圓宗), 초호 연하(蓮下)이다. \n\n황해도 해주에서 출생했다. 15세 때 한학자 정문재(鄭文哉)에게서 한학을 배웠고, 1893년 동학(東學)에 입교하여 접주(接主)가 되고 이듬해 팔봉도소접주(八峯都所接主)에 임명되어 해주에서 동학농민운동을 지휘하다가 일본군에게 쫓겨 1895년 만주로 피신하여 김이언(金利彦)의 의병단에 가입하였다.
    `
};

export const IndActivist = [Han, Lee, Kim];
